{
  "documents": [
    "The English language doesn’t exist – it’s just French that’s badly pronounced\n\nThe English language doesn’t exist – it’s just French that’s badly pronounced\nRichard Good\n\nIs English nothing more than a regional dialect of French? That’s the wilfully provocative claim made by linguist Bernard Cerquiglini in his new book, La langue anglaise n’existe pas, c’est du français mal prononcé. It’s an entertaining and stimulating essay – and a highly recommended read for learners of French\n\nSaved from being Dutch\nThe title of the book translates as “The English language doesn’t exist – it’s just French that’s badly pronounced” , which is a quip First World War French President Georges Clemenceau used to make. The author admits from the outset that he’s writing somewhat tongue in cheek. But he’s a distinguished linguist – and he pulls no punches as he sets out his case.",
    "But he’s a distinguished linguist – and he pulls no punches as he sets out his case. The conventional wisdom is that English is essentially a Germanic language, Anglo-Saxon, with a layer of French vocabulary added on top in the wake of the Norman Conquest. Cerquiglini argues that the role of French in the birth of the English language was much deeper than is generally admitted. It is the French influence, he says, that saved English from being just another variant of Dutch. As such it was French that equipped English to become the language of international communication, a state of affairs which should be celebrated as la francophonie’s greatest achievement. Ties of paternity\nThe core of the essay sets out the ties of paternity linking Latin, French and Norman to the English language. Half of all English vocabulary comes from those three Romance roots, compared to less than a third that comes from Germanic sources.",
    "Half of all English vocabulary comes from those three Romance roots, compared to less than a third that comes from Germanic sources. Half of all English vocabulary comes from those three Romance roots, compared to less than a third that comes from Germanic sources. Cerquiglini shows that it’s the Norman accent that explains the differences between French and English in pairs like  guerre > war, jardin > garden, coussin > cushion, marché > market, bouteilleur  > butler. English, he says, is not so much badly-pronounced French, but French pronounced with a Norman accent. Why has the vibrancy of Norman culture in England been ignored for so long? Eighteen of the twenty French books that have survived from the 12th century were written in Norman dialect. Cerquiglini argues that playing down Norman influence suited both British and French scholars. The British wanted to assert their independence. The French viewed Norman as a heretical (and inferior) version of Parisian French.",
    "The French viewed Norman as a heretical (and inferior) version of Parisian French. Separate paths\nFrom the 15th century onwards, English and French went on their own separate paths. As usage has evolved, words with identical origins have finished up with different meanings, creating faux amis between the two contemporary languages. Sometimes it’s French that’s evolved. Les forains in French used to have the same meaning as the English word foreigners, whereas as today forains identifies people associated with travelling fairs. Sometimes it’s English that’s evolved. The French adjective niais(e) describes someone who’s a simpleton. That too was the old meaning of the English word nice, which only took on positive connotations in the 18th century. Désesperanto – the new global English\nWhile Cerquiglini is happy to celebrate the common roots of the French and English languages, he has no time for the global airport English of international communication, for which he coins the wonderful term désesperanto.",
    "Désesperanto – the new global English\nWhile Cerquiglini is happy to celebrate the common roots of the French and English languages, he has no time for the global airport English of international communication, for which he coins the wonderful term désesperanto. It’s galling for him to hear words of French origin being fed back into the language with anglicised pronunciation. French business leaders now pronounce the word Challenges with an English ch sound, though the word existed in old French with a soft ch. An e-mail is un mail (pronounced in the English way), though the word’s origin is the French noun la malle meaning a leather bag. Cerquiglini prefers courriel. He describes the input of anglicisms as a battle between regional dialects (English being a dialect of French). But he’d much rather global English were binned completely, with AI translation enabling people to speak to each other using their native languages. Conclusion\nEnglish isn’t a dialect of French. The grammatical structure of English is almost entirely Germanic and no amount of sophistry can change that.",
    "The grammatical structure of English is almost entirely Germanic and no amount of sophistry can change that. Conclusion\nEnglish isn’t a dialect of French. The grammatical structure of English is almost entirely Germanic and no amount of sophistry can change that. The author knows this of course. His point is not to win the argument, but rather to give a new perspective on the traditional rivalry between the English and French languages.",
    "FBI Demands Data from Provider Tucows\n\nIt is one of the most mysterious and, at the same time, best-known websites on the internet. Archive.today has built up a user base over a period of more than ten years who use the service to access previous snapshots of a web page. So basically like the Wayback Machine of the Internet Archive, only largely free of rules and presumably therefore also anonymous. To the chagrin of the media industry, the service is also often used to bypass paywalls. This is also possible because the service does not adhere to common rules and laws and offers no opt-out option. And so far, the operators have gotten away with it. Although there have been minor problems in the history of the service occasionally, for example, a top-level domain operator denied them further use of one of the many archive domains. However, the operation of the project, which is allegedly financed by donations and own funds, was not seriously endangered.",
    "However, the operation of the project, which is allegedly financed by donations and own funds, was not seriously endangered. Court Order in the USA\nBut now the operators of archive.today are apparently fearing bigger trouble. In recent months and years, they had become noticeably quieter. Until two years ago, for example, questions were regularly answered in the blog. In the official X account, which had been silent for over a year, a new post appeared at the end of October new post. “Canary,” it said there, along with a URL. The mentioned canary bird is likely an allusion to an old custom in mining. A canary brought along warned the miners when it keeled over dead about the threat of invisible gas.",
    "A canary brought along warned the miners when it keeled over dead about the threat of invisible gas. The deadly danger that the site operators fear is apparently linked to the PDF linked in the X post linked PDF. It contains a court order that the US investigative authority FBI has obtained. It instructs the Canadian provider Tucows to hand over comprehensive data about the customer behind archive.today. It concerns address and connection data as well as payment information. If Tucows does not provide the data, penalties are threatened. Whether the court order is genuine and how the operators of the site obtained it could not be verified so far.",
    "Whether the court order is genuine and how the operators of the site obtained it could not be verified so far. Is the operator based in Russia? Why the FBI is currently interested in archive.today, which is also accessible under the domains archive.is and archive.ph, is not evident from the court order. However, there are several obvious starting points for investigations: in addition to the obvious reason of copyright issues, the investigators could also be pursuing suspicions about unclear financing, the origin of the operators, or the technical approach. In 2023, Finnish blogger Janni Patokallio compiled various clues and research results in a post in a post. According to this, Archive.today uses a botnet with changing IP addresses to circumvent anti-scraping measures. There are also indications that the operator(s) are based in Russia. Another private investigation from 2024 comes to a different conclusion. It names a software developer from New York as the alleged operator. According to this investigation, following the trail to Eastern Europe proved to be a red herring."
  ],
  "metadata": [
    {
      "title": "The English language doesn’t exist – it’s just French that’s badly pronounced",
      "topics": [
        "Language"
      ],
      "source": "news",
      "url": "https://www.frenchclasses.com/tablettes-de-chocolat/the-english-language-doesnt-exist-its-just-french-thats-badly-pronounced/",
      "added_at": "2025-11-06T18:19:46.848362"
    },
    {
      "title": "The English language doesn’t exist – it’s just French that’s badly pronounced",
      "topics": [
        "Language"
      ],
      "source": "news",
      "url": "https://www.frenchclasses.com/tablettes-de-chocolat/the-english-language-doesnt-exist-its-just-french-thats-badly-pronounced/",
      "added_at": "2025-11-06T18:19:47.235942"
    },
    {
      "title": "The English language doesn’t exist – it’s just French that’s badly pronounced",
      "topics": [
        "Language"
      ],
      "source": "news",
      "url": "https://www.frenchclasses.com/tablettes-de-chocolat/the-english-language-doesnt-exist-its-just-french-thats-badly-pronounced/",
      "added_at": "2025-11-06T18:19:47.562651"
    },
    {
      "title": "The English language doesn’t exist – it’s just French that’s badly pronounced",
      "topics": [
        "Language"
      ],
      "source": "news",
      "url": "https://www.frenchclasses.com/tablettes-de-chocolat/the-english-language-doesnt-exist-its-just-french-thats-badly-pronounced/",
      "added_at": "2025-11-06T18:19:47.869224"
    },
    {
      "title": "The English language doesn’t exist – it’s just French that’s badly pronounced",
      "topics": [
        "Language"
      ],
      "source": "news",
      "url": "https://www.frenchclasses.com/tablettes-de-chocolat/the-english-language-doesnt-exist-its-just-french-thats-badly-pronounced/",
      "added_at": "2025-11-06T18:19:48.278311"
    },
    {
      "title": "The English language doesn’t exist – it’s just French that’s badly pronounced",
      "topics": [
        "Language"
      ],
      "source": "news",
      "url": "https://www.frenchclasses.com/tablettes-de-chocolat/the-english-language-doesnt-exist-its-just-french-thats-badly-pronounced/",
      "added_at": "2025-11-06T18:19:48.584141"
    },
    {
      "title": "FBI Demands Data from Provider Tucows",
      "topics": [
        "Technology",
        "News"
      ],
      "source": "news",
      "url": "https://www.heise.de/en/news/Archive-today-FBI-Demands-Data-from-Provider-Tucows-11066346.html",
      "added_at": "2025-11-06T18:22:06.310296"
    },
    {
      "title": "FBI Demands Data from Provider Tucows",
      "topics": [
        "Technology",
        "News"
      ],
      "source": "news",
      "url": "https://www.heise.de/en/news/Archive-today-FBI-Demands-Data-from-Provider-Tucows-11066346.html",
      "added_at": "2025-11-06T18:22:06.824328"
    },
    {
      "title": "FBI Demands Data from Provider Tucows",
      "topics": [
        "Technology",
        "News"
      ],
      "source": "news",
      "url": "https://www.heise.de/en/news/Archive-today-FBI-Demands-Data-from-Provider-Tucows-11066346.html",
      "added_at": "2025-11-06T18:22:07.130248"
    },
    {
      "title": "FBI Demands Data from Provider Tucows",
      "topics": [
        "Technology",
        "News"
      ],
      "source": "news",
      "url": "https://www.heise.de/en/news/Archive-today-FBI-Demands-Data-from-Provider-Tucows-11066346.html",
      "added_at": "2025-11-06T18:22:07.450986"
    }
  ],
  "last_updated": "2025-11-06T18:22:07.451450"
}