{
  "documents": [
    "How AI generated code compounds technical debt\n\nAI Coding Tools Are Driving Code Duplication and Technical Debt, GitClear Report Warns\nGitClear’s 2025 AI Copilot Code Quality report reveals a troubling trend: as AI coding assistants like Cursor and GitHub Copilot become ubiquitous, code duplication is surging and long-term code quality is declining. “I don’t think I have ever seen so much technical debt being created in such a short period of time during my 35-year career in technology.”\n— Kin Lane, API Evangelist\n\n\nKey Findings from 211 Million Lines of Code (2020–2024)\nAnalyzing anonymized private repos and 25 major open-source projects, GitClear found:\n\n8x increase in duplicated code blocks (5+ lines) in 2024 vs. prior years — 10x higher than two years ago. 46% of code changes were new lines; copy-pasted lines outnumbered moved lines. \"Moved\" lines — GitClear’s metric for refactoring and reuse — are in steep decline.",
    "\"Moved\" lines — GitClear’s metric for refactoring and reuse — are in steep decline. “Refactored systems, and moved code in particular, are the signature of code reuse.”\n— Bill Harding, CEO of GitClear & Amplenote\n\nThis shift signals developers are less likely to consolidate logic into reusable modules — a direct violation of the DRY (Don’t Repeat Yourself) principle. More Code ≠ Better Code\nDespite perceived productivity gains, AI-generated code is creating hidden maintenance burdens:\n\nThe Harness State of Software Delivery 2025 report found developers spend more time debugging AI code and fixing security vulnerabilities. Google’s 2024 DORA report: +25% AI usage speeds reviews and docs, but cuts delivery stability by 7.2%. “If developer productivity continues being measured by commit count or lines added, AI-driven maintainability decay will proliferate.”\n— Bill Harding\n\n\nThe Real Cost of Code Cloning\nDuplicated code isn’t just messy — it’s expensive:",
    "“If developer productivity continues being measured by commit count or lines added, AI-driven maintainability decay will proliferate.”\n— Bill Harding\n\n\nThe Real Cost of Code Cloning\nDuplicated code isn’t just messy — it’s expensive: The Real Cost of Code Cloning\nDuplicated code isn’t just messy — it’s expensive:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImpactConsequenceStorageHigher cloud costsBugsDefects multiply across clonesTestingComplex, error-proneMaintenanceChanges must be made in multiple places\nA 2023 study from Central China Normal University confirms: code clones significantly increase defect rates. The Human Role in AI-Assisted Development\nAI excels at rapid generation, but its limited context window means it often fails to see the full codebase. Humans remain essential for:\n\nRefactoring repetitive logic\nConsolidating modules\nReusing microservices\nEnforcing architectural consistency\n\n\n“There is a lot of utility that AI provides, but the data from this year affirms why long-term-oriented devs might eye their ‘tab’ key with a faint sense of foreboding.”\n— Bill Harding\n\n\nHow to Fight Back",
    "Humans remain essential for:\n\nRefactoring repetitive logic\nConsolidating modules\nReusing microservices\nEnforcing architectural consistency\n\n\n“There is a lot of utility that AI provides, but the data from this year affirms why long-term-oriented devs might eye their ‘tab’ key with a faint sense of foreboding.”\n— Bill Harding\n\n\nHow to Fight Back How to Fight Back\n\nMeasure reuse, not just output (track \"moved\" lines, not LOC). Use AI to refactor — tools like Cursor can enforce consistency. Set explicit rules: “Never duplicate — always modify existing code.”\nAudit regularly for clones and redundant systems. Bottom Line\nAI coding tools are powerful accelerators — but without discipline, they risk turning software into infinite, unmaintainable sprawl. The future of sustainable development depends on using AI to refactor, not just generate.",
    "Monorepo vs Multi-repo vs Git submodule vs Git Subtree\n\nMonorepo vs Multi-repo vs Git submodule vs Git Subtree: A Complete Guide for Developers\nSubodh Shetty\nSubodh Shetty\n\nFollow\n5 min read\n·\n2 days ago\n44\n\n\n1\n\n\n\nPress enter or click to view image in full size\n\nMonoRepo vs MultiRepo vs Git Submodule vs Git Subtree\nAs projects grow, one question quietly becomes a big one:\n\n“Where should all this code live?”\n\nSome teams prefer to keep everything in one place. Others prefer to split things into smaller, separate repositories. A few connect repositories using Git submodules or subtrees. In this guide, we’ll walk through each strategy in plain English. You’ll learn what each one does, when it helps, and what you trade off when you choose it. 1. Monorepo\nA monorepo means one big repository for all your projects. That includes backend, frontend, libraries, and sometimes even deployment scripts. Example\nImagine you are building an e-commerce system. Your structure might look like this:",
    "Your structure might look like this: Example\nImagine you are building an e-commerce system. Your structure might look like this:\n\n\nFolder structure\nDevelopers from multiple teams work inside this same repository.",
    "Your structure might look like this:\n\n\nFolder structure\nDevelopers from multiple teams work inside this same repository. Folder structure\nDevelopers from multiple teams work inside this same repository. Why teams use monorepos\nMonorepos make it easier to change related code together. Suppose your frontend and backend share a common API. You can update both sides in one pull request, and both will stay in sync. You also have one build pipeline, one testing setup, and one linting configuration. That makes consistency simple. What to keep in mind\nWhen a monorepo grows, builds can become slow if you do not optimize them. You also need a clear sense of code ownership. Without that, people can make changes in places they shouldn’t. CODEOWNERS files help define who reviews which parts of the repository. When it fits\nMonorepos work best for small to medium teams where services are closely connected. They make shared tooling and cross-team collaboration easier. 2. Multi-repo (or Polyrepo)\nA multi-repo setup means each project has its own repository. It is the most common approach in the industry.",
    "It is the most common approach in the industry. Example\nYour company might have following Git repositories:\n\nPress enter or click to view image in full size\n\nEach repository has its own CI/CD setup, its own issue tracker, and its own release process.",
    "Example\nYour company might have following Git repositories:\n\nPress enter or click to view image in full size\n\nEach repository has its own CI/CD setup, its own issue tracker, and its own release process. Each repository has its own CI/CD setup, its own issue tracker, and its own release process. Why teams use multi-repos\nMulti-repos give teams freedom. Each team controls its own repo, deployment, and tools. The frontend team can use React while the backend uses Spring Boot or Node.js. Access control also becomes easier. Only members who work on a service need access to its repository. Real-world example\nThink of a company that has separate payments, catalog, and shipping teams. Each one builds its own service. They deploy independently and have different release schedules. That independence makes multi-repo a good fit. What to keep in mind\nWhen multiple repos depend on a shared library, keeping them consistent can be hard. If you fix a bug in that library, you need to update each repo using it. Cross-repo changes take longer and require coordination. When it fits\nMulti-repos are ideal for larger teams where services are mostly independent and ownership boundaries are clear.",
    "When it fits\nMulti-repos are ideal for larger teams where services are mostly independent and ownership boundaries are clear. 3. Git Submodules\nA Git submodule adds a reference to another repository at a specific commit. It does not copy the repository’s content into your main repo’s history. Instead, it just stores a pointer to the commit in the external repo. Example\nYou have:\n\nmain-app repository\nshared-logging repository\nYou add it like this:\n\ngit submodule add https://github.com/org/shared-logging.git libs/shared-logging\nYour main repository now contains the shared-logging code inside the libs/shared-logging folder. Updating a submodule\nIf the submodule has new commits, you need to pull them manually:\n\ncd libs/shared-logging\ngit checkout main\ngit pull origin main\ncd ../..\ngit add libs/shared-logging\ngit commit -m \"Update submodule to latest commit\"\nThat updates your main repo to point to the newer commit of the submodule. Cloning your main repo\nWhen someone clones your main repo, they have to run the following to download that external code. :",
    ": Cloning your main repo\nWhen someone clones your main repo, they have to run the following to download that external code. :\n\ngit submodule update --init --recursive\nOptional tracking\nIf you want your submodule to follow a specific branch:\n\ngit submodule add -b main https://github.com/org/shared-logging.git libs/shared-logging\nThen fetch updates using:",
    ":\n\ngit submodule update --init --recursive\nOptional tracking\nIf you want your submodule to follow a specific branch:\n\ngit submodule add -b main https://github.com/org/shared-logging.git libs/shared-logging\nThen fetch updates using: git submodule add -b main https://github.com/org/shared-logging.git libs/shared-logging\nThen fetch updates using:\n\ngit submodule update --remote\nWhy it exists\nSubmodules are designed for situations where you want to reuse code that lives in another repository. It’s like having a dependency that you control. You decide when to upgrade to the next version by updating the pointer. What to keep in mind\nSubmodules need discipline. Submodules don’t auto-update. You must manually pull updates. You have to remember to initialize them and update them when cloning. CI/CD pipelines must also handle them properly. 4. Git Subtree\nWhile submodules keep a pointer to another repository, a Git subtree actually copies the other repository’s content into your own. It is like pulling another repository’s code into a subfolder. Example\nYou can add a subtree like this:",
    "Example\nYou can add a subtree like this: Example\nYou can add a subtree like this:\n\ngit subtree add --prefix=libs/shared-logging https://github.com/org/shared-logging.git main --squash\nThis command copies all code from the shared-logging repository into the folder libs/shared-logging and adds it as part of your project. When the shared library gets updates, you can pull those updates later:\n\ngit subtree pull --prefix=libs/shared-logging https://github.com/org/shared-logging.git main --squash\nIf you make local changes and want to send them back upstream:",
    "When the shared library gets updates, you can pull those updates later:\n\ngit subtree pull --prefix=libs/shared-logging https://github.com/org/shared-logging.git main --squash\nIf you make local changes and want to send them back upstream: git subtree push --prefix=libs/shared-logging https://github.com/org/shared-logging.git main\nHow it works\nA subtree merges the other repository’s history into yours. The files become a permanent part of your repository. Your project can now build without needing the external repository. Advantages\nNo extra setup for developers. Works with normal git clone. No special CI handling required. All code is available locally. What to keep in mind\nYour repository size grows because it includes the subtree’s history. Managing many subtrees can become complex. You need to remember which folder maps to which external repository. When to use\nSubtrees are a good fit when you want to vendor another repository’s code. That means you want to copy it inside your repo and update it occasionally. It’s common for internal forks or open-source libraries that you customize. In Conclusion,",
    "In Conclusion, That means you want to copy it inside your repo and update it occasionally. It’s common for internal forks or open-source libraries that you customize. In Conclusion,\nRepository structure influences how teams work, not just how code is stored. It affects how you test, deploy, and collaborate.",
    "It affects how you test, deploy, and collaborate. Before deciding, ask:\n\nHow independent are your services? How often do they change together? How do you want to manage shared code? A monorepo offers simplicity and consistency. A multi-repo offers independence and flexibility. A submodule links projects that evolve separately. A subtree embeds projects that need to live together. Each one solves a different kind of problem. Once you understand their behavior, choosing the right one becomes straightforward."
  ],
  "metadata": [
    {
      "article_id": "6468270047648745042",
      "chunk_id": 0,
      "title": "How AI generated code compounds technical debt",
      "topics": [
        "AI",
        "Technology"
      ],
      "source": "news",
      "url": "https://leaddev.com/technical-direction/how-ai-generated-code-accelerates-technical-debt",
      "added_at": "2025-11-09T12:01:24.411434"
    },
    {
      "article_id": "6468270047648745042",
      "chunk_id": 1,
      "title": "How AI generated code compounds technical debt",
      "topics": [
        "AI",
        "Technology"
      ],
      "source": "news",
      "url": "https://leaddev.com/technical-direction/how-ai-generated-code-accelerates-technical-debt",
      "added_at": "2025-11-09T12:01:24.820594"
    },
    {
      "article_id": "6468270047648745042",
      "chunk_id": 2,
      "title": "How AI generated code compounds technical debt",
      "topics": [
        "AI",
        "Technology"
      ],
      "source": "news",
      "url": "https://leaddev.com/technical-direction/how-ai-generated-code-accelerates-technical-debt",
      "added_at": "2025-11-09T12:01:25.126173"
    },
    {
      "article_id": "6468270047648745042",
      "chunk_id": 3,
      "title": "How AI generated code compounds technical debt",
      "topics": [
        "AI",
        "Technology"
      ],
      "source": "news",
      "url": "https://leaddev.com/technical-direction/how-ai-generated-code-accelerates-technical-debt",
      "added_at": "2025-11-09T12:01:26.150198"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 0,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:47.053167"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 1,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:47.361562"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 2,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:47.564209"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 3,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:47.872183"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 4,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:48.180725"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 5,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:48.486433"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 6,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:48.794964"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 7,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:49.101697"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 8,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:49.408001"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 9,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:49.715226"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 10,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:50.637616"
    },
    {
      "article_id": "9031711621983707363",
      "chunk_id": 11,
      "title": "Monorepo vs Multi-repo vs Git submodule vs Git Subtree",
      "topics": [
        "Technology",
        "Code",
        "Software",
        "Dev"
      ],
      "source": "news",
      "url": "https://levelup.gitconnected.com/monorepo-vs-multi-repo-vs-git-submodule-vs-git-subtree-a-complete-guide-for-developers-961535aa6d4c",
      "added_at": "2025-11-09T12:03:50.945173"
    }
  ],
  "last_updated": "2025-11-09T12:03:50.945736"
}